# Birthdays and Baby Names - ETL Project

In [1]:
# ETL_Project_TK_ES
# data extraction, transform, and load project on births and baby names in USA
# Trevor Kulbeth
# Eric Staveley
# MWSa Cohort
#
# need to perform a     !pip install mysqlclient

In [2]:
import pandas as pd
from sqlalchemy import create_engine
import datetime as dt

### ETL for Birthdays between 1994 and 2003

In [3]:
#EXTRACT, TRANSFORM, LOAD
#csv method...
data_file = "births.csv"

In [4]:
#construct the df
df_from_csv = pd.read_csv(data_file)
print(f"Raw data births record count: {len(df_from_csv)}")
df_from_csv.head()

Raw data births record count: 3652

   year  month  date_of_month  day_of_week  births
0  1994      1              1            6    8096
1  1994      1              2            7    7772
2  1994      1              3            1   10142
3  1994      1              4            2   11248
4  1994      1              5            3   11053

In [5]:
#clean up the data in incident df

#get rid of the NaNs found
print(f"Non-NA values per column:\n{df_from_csv.count()}")   #show the non-NA cells for each field

#remove the rows with any empty cells
df_from_csv_clean = df_from_csv.dropna(how='any')

print(f"Total of rows with complete data now: {len(df_from_csv_clean)}")

Non-NA values per column:
year             3652
month            3652
date_of_month    3652
day_of_week      3652
births           3652
dtype: int64
Total of rows with complete data now: 3652

In [7]:
df_from_csv_clean.dtypes

year             int64
month            int64
date_of_month    int64
day_of_week      int64
births           int64
dtype: object

In [8]:
#make a datetime field of a full date
df_from_csv_clean['Birthdate'] = df_from_csv_clean.apply(lambda x: dt.date(x['year'], x['month'], x['date_of_month']), axis=1)
#type(df_from_csv_clean['Birthdate'][0])

In [9]:
df_from_csv_clean.head()

   year  month  date_of_month  day_of_week  births   Birthdate
0  1994      1              1            6    8096  1994-01-01
1  1994      1              2            7    7772  1994-01-02
2  1994      1              3            1   10142  1994-01-03
3  1994      1              4            2   11248  1994-01-04
4  1994      1              5            3   11053  1994-01-05

In [53]:
#peek at the dt date ranges with data
print(f"Earliest date with data: {min(df_from_csv_clean['Birthdate'])}")
print(f"Latest date with data: {max(df_from_csv_clean['Birthdate'])}")

Earliest date with data: 1994-01-01
Latest date with data: 2003-12-31

In [54]:
#reorganize so order is Birthdate, births, year, month, date_of_month, day_of_week
temp_births_df = df_from_csv_clean[['Birthdate', 'births', 'year', 'month', 'date_of_month', 'day_of_week']]

In [55]:
temp_births_df.head()

    Birthdate  births  year  month  date_of_month  day_of_week
0  1994-01-01    8096  1994      1              1            6
1  1994-01-02    7772  1994      1              2            7
2  1994-01-03   10142  1994      1              3            1
3  1994-01-04   11248  1994      1              4            2
4  1994-01-05   11053  1994      1              5            3

In [56]:
births_df = temp_births_df.rename(index=str, columns={"Birthdate" : "BIRTHDATE", "births": "NUM_BIRTHS", "year":"YEAR","month":"MONTH" , "date_of_month" : "DATE_OF_MONTH", "day_of_week":"DAY_OF_WEEK" })

In [57]:
births_df.head()

    BIRTHDATE  NUM_BIRTHS  YEAR  MONTH  DATE_OF_MONTH  DAY_OF_WEEK
0  1994-01-01        8096  1994      1              1            6
1  1994-01-02        7772  1994      1              2            7
2  1994-01-03       10142  1994      1              3            1
3  1994-01-04       11248  1994      1              4            2
4  1994-01-05       11053  1994      1              5            3

In [58]:
births_df.dtypes

BIRTHDATE        object
NUM_BIRTHS        int64
YEAR              int64
MONTH             int64
DATE_OF_MONTH     int64
DAY_OF_WEEK       int64
dtype: object

### ETL for Baby Names

In [59]:
# Read CSV into notebook and create dataframe
csv_file = "NationalNames.csv"
main_df = pd.read_csv(csv_file)
print(f"Raw data for birth names count: {len(main_df)}")
main_df.head()

Raw data for birth names count: 1825433

   Id       Name  Year Gender  Count
0   1       Mary  1880      F   7065
1   2       Anna  1880      F   2604
2   3       Emma  1880      F   2003
3   4  Elizabeth  1880      F   1939
4   5     Minnie  1880      F   1746

In [60]:
# Clean all extra data not within our year range
cleaned_years_df = main_df.drop(main_df[(main_df.Year < 1994) | (main_df.Year > 2003)].index)
cleaned_years_df = cleaned_years_df.reset_index()
cleaned_years_df = cleaned_years_df.drop(['Id', 'index'], axis=1)
cleaned_years_df.head()

       Name  Year Gender  Count
0   Jessica  1994      F  32116
1    Ashley  1994      F  30277
2     Emily  1994      F  24148
3  Samantha  1994      F  22819
4     Sarah  1994      F  22275

In [61]:
#clean up any empty rows
print(f"Non-NA values per column:\n{cleaned_years_df.count()}") 

#Remove any rows with empty cells
cleaned_names_df = cleaned_years_df.dropna(how='any')

print(f"Total of rows with complete data now: {len(cleaned_names_df)}")

Non-NA values per column:
Name      283653
Year      283653
Gender    283653
Count     283653
dtype: int64
Total of rows with complete data now: 283653

In [62]:
cleaned_names_df.head()

       Name  Year Gender  Count
0   Jessica  1994      F  32116
1    Ashley  1994      F  30277
2     Emily  1994      F  24148
3  Samantha  1994      F  22819
4     Sarah  1994      F  22275

In [63]:
baby_names_df = cleaned_names_df[["Name", "Gender", "Year", "Count"]]

In [64]:
baby_names_df = baby_names_df.rename(index=str, columns={"Name": "BABY_NAME", "Gender": "GENDER", "Year": "YEAR", "Count": "COUNT" })
baby_names_df.head()

  BABY_NAME GENDER  YEAR  COUNT
0   Jessica      F  1994  32116
1    Ashley      F  1994  30277
2     Emily      F  1994  24148
3  Samantha      F  1994  22819
4     Sarah      F  1994  22275

### Ensure the MySQL database schema was pre-constructed via MySQL Workbench:


Perform outside of this script, and the execution of any further code access.   The below SQL was used in MySQL Wrokbench to construct the database schema:

(also found in queries.sql  file in repo)

-- Create and use database:    baby_names_and_birthdays_db

CREATE DATABASE baby_names_and_birthdays_db;
USE baby_names_and_birthdays_db;

-- birthdays table
-- Create tables for raw data to be loaded into

CREATE TABLE birthdays (
  id INT NOT NULL AUTO_INCREMENT PRIMARY KEY,
  BIRTHDATE datetime,
  NUM_BIRTHS integer,
  YEAR integer,
  MONTH integer,
  DATE_OF_MONTH integer,
  DAY_OF_WEEK integer);
  
  
---- baby names table
-- Create tables for raw data to be loaded into

 CREATE TABLE baby_names (
  id INT NOT NULL AUTO_INCREMENT PRIMARY KEY,
  BABY_NAME varchar(50),
  GENDER varchar(10),
  YEAR integer,
  COUNT integer);
  
NOTE:  
Very important to ensure guest account had the baby_names_and_birthdays_db schema available to access.

Data loading into the DB was clean and error free.

### Connect To Local Database (guest account)

In [65]:
rds_connection_string = "guest:guest123#@127.0.0.1/baby_names_and_birthdays_db"
engine = create_engine(f'mysql://{rds_connection_string}')
engine

Engine(mysql://guest:***@127.0.0.1/baby_names_and_birthdays_db)

### Check for tables seen after connection

In [66]:
engine.table_names()

['baby_names', 'birthdays']

### Use pandas to load csv-converted DataFrame (births_df & baby_names_df) into database table birthdays

In [42]:
births_df.to_sql(name='birthdays', con=engine, if_exists='append', index=False)

In [43]:
baby_names_df.to_sql(name='baby_names', con=engine, if_exists='append', index=False)

### Confirm data has been added by querying the customer_name table

In [67]:
pd.read_sql_query('select * from birthdays', con=engine).head()

   id  BIRTHDATE  NUM_BIRTHS  YEAR  MONTH  DATE_OF_MONTH  DAY_OF_WEEK
0   1 1994-01-01        8096  1994      1              1            6
1   2 1994-01-02        7772  1994      1              2            7
2   3 1994-01-03       10142  1994      1              3            1
3   4 1994-01-04       11248  1994      1              4            2
4   5 1994-01-05       11053  1994      1              5            3

In [68]:
pd.read_sql_query('select * from baby_names', con=engine).head()

   id BABY_NAME GENDER  YEAR  COUNT
0   1   Jessica      F  1994  32116
1   2    Ashley      F  1994  30277
2   3     Emily      F  1994  24148
3   4  Samantha      F  1994  22819
4   5     Sarah      F  1994  22275